Extensions/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПолученоНаличными</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>AzRyАналитикаКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>AzRyЭлектроннаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплатыПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоммерОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Консультант</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиПоДисконтнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Консультант</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособОкругления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>24</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыСтруктурныхЕдиниц</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Розница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Documents/ЧекККМ/Forms/ФормаДокумента/Module.bsl
&НаСервере
&Вместо("УстановитьДоступностьОплаты")
Процедура РасшAzRy_УстановитьДоступностьОплаты()
	
	Если Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Наличные
		// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
		Или Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.AzRyРасходнаяНакладнаяНаличные Тогда
		// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	
		Элементы.ОплатаПлатежнымиКартами.Доступность = Ложь;
		Элементы.СтраницаОплатаПлатежнымиКартами.Видимость = Ложь;
		Элементы.ПолученоНаличными.Доступность = ?(
			КонтрольНаСкладеОтключен,
			Истина,
			Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
		);
		Элементы.РасчитатьСуммуНаличнойОплаты.Доступность = ?(
			КонтрольНаСкладеОтключен,
			Истина,
			Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
		);
	
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда // Смешанная
	
		Элементы.ОплатаПлатежнымиКартами.Доступность = ?(
			КонтрольНаСкладеОтключен,
			Истина,
			Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
		);
		Элементы.СтраницаОплатаПлатежнымиКартами.Видимость = Истина;
		Элементы.ПолученоНаличными.Доступность = ?(
			КонтрольНаСкладеОтключен,
			Истина,
			Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
		);
		Элементы.РасчитатьСуммуНаличнойОплаты.Доступность = ?(
			КонтрольНаСкладеОтключен,
			Истина,
			Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
		);
	
	Иначе // Платежными картами
		
		Элементы.ОплатаПлатежнымиКартами.Доступность = ?(
			КонтрольНаСкладеОтключен,
			Истина,
			Объект.Статус = Перечисления.СтатусыЧековККМ.ТоварЗарезервирован
		);
		Элементы.СтраницаОплатаПлатежнымиКартами.Видимость = Истина;
		Элементы.ПолученоНаличными.Доступность = Ложь;
		Элементы.РасчитатьСуммуНаличнойОплаты.Доступность = Ложь;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПолучитьСписокВыбораВидовПлатежныхКарт();
	КонецЕсли;
	
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	Иначе
		УстановитьВидимостьИДоступность();
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	
	// +++ { AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	//КонтрольНаСкладеОтключен = НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить()
	КонтрольНаСкладеОтключен = НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков()
	// +++ } AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
						   ИЛИ НЕ Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Получить();
	Элементы.Зарезервировать.Видимость = НЕ КонтрольНаСкладеОтключен;
	Элементы.СнятьРезервирование.Видимость = НЕ КонтрольНаСкладеОтключен;
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Объект.ВалютаДокумента));
	Курс = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Курс
	);
	Кратность = ?(
		СтруктураПоВалюте.Курс = 0,
		1,
		СтруктураПоВалюте.Кратность
	);
	
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, Новый Структура("Валюта", Константы.НациональнаяВалюта.Получить()));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.НалогообложениеНДС = Неопределено;
		ЗаполнитьСтавкуНДСПоОрганизациияНалогообложениеНДС();
		Если ЗначениеЗаполнено(Объект.Заказ) Тогда
			ПроверитьВалютуДокументаОснования(Истина);
		КонецЕсли;
	ИначеЕсли Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда	
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыВсего.Видимость = Истина;
	Иначе
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыВсего.Видимость = Ложь;
	КонецЕсли;
	
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВидЦен, ВидСкидки, ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, НалогообложениеНДС, ДисконтнаяКарта, ПроцентСкидкиПоДисконтнойКарте", Объект.ВидЦен, Объект.ВидСкидкиНаценки, Объект.ВалютаДокумента, Объект.ВалютаДокумента, Курс, КурсНациональнаяВалюта, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, Объект.НалогообложениеНДС, Объект.ДисконтнаяКарта, Объект.ПроцентСкидкиПоДисконтнойКарте);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	
	КассаККМИспользоватьБезПодключенияОборудования = Объект.КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	ИспользуетсяРегистрацияРозничныхПродажВЕГАИС = УправлениеНебольшойФирмойСервер.ИспользуетсяРегистрацияРозничныхПродажВЕГАИС();
	
	УстановитьДоступностьПечатиЧека();
	Элементы.ОплатаПлатежнымиКартами.Доступность = ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал);
	
	Если Объект.Статус = Перечисления.СтатусыЧековККМ.Пробит Тогда
		УстановитьРежимТолькоПросмотр();
	КонецЕсли;
	
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	//УстановитьДоступностьОплаты();
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:	
	
	Элементы.ЗапасыСуммаСкидкиНаценки.Видимость = Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить();
	
	УправлениеНебольшойФирмойСервер.НастроитьГруппуЦеныИВалюты(ЭтаФорма);
	
	// Установка доступности цен для редактирования.
	РазрешеноРедактированиеЦенДокументов = УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.РазрешеноРедактированиеЦенДокументов();
	ПродажаСоСклада = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Склад;
	
	Элементы.ЗапасыЦена.ТолькоПросмотр 					= НЕ РазрешеноРедактированиеЦенДокументов ИЛИ НЕ ПродажаСоСклада;
	Элементы.ЗапасыСумма.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов ИЛИ НЕ ПродажаСоСклада; 
	Элементы.ЗапасыПроцентСкидкиНаценки.ТолькоПросмотр  = НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаСкидкиНаценки.ТолькоПросмотр 	= НЕ РазрешеноРедактированиеЦенДокументов;
	Элементы.ЗапасыСуммаНДС.ТолькоПросмотр 				= НЕ РазрешеноРедактированиеЦенДокументов;
	
	УправлениеНебольшойФирмойКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);
	
	ЗаголовокСуммаЧека = НСтр("ka='ჩეკის თანხა (%Валюта%)';ru='Сумма чека (%Валюта%)';en='check Amount (% Currency%)'");
	ЗаголовокСуммаЧека = СтрЗаменить(ЗаголовокСуммаЧека, "%Валюта%", Объект.ВалютаДокумента);
	Элементы.СуммаДокумента.Подсказка = ЗаголовокСуммаЧека;
	
	ЗаголовокПолученоНаличными = НСтр("ka='მიღებულია ნაღდი ფულით (%Валюта%)';ru='Получено наличными (%Валюта%)';en='Cash received (% Currency%)'");
	ЗаголовокПолученоНаличными = СтрЗаменить(ЗаголовокПолученоНаличными, "%Валюта%", Объект.ВалютаДокумента);
	Элементы.ПолученоНаличными.Подсказка = ЗаголовокПолученоНаличными;
	
	ЗаголовокОплатаПлатежнымиКартами = НСтр("ka='საგადახდო ბარათებით (%Валюта%)';ru='Платежными картами (%Валюта%)';en='Payment cards (% Currency%)'");
	ЗаголовокОплатаПлатежнымиКартами = СтрЗаменить(ЗаголовокОплатаПлатежнымиКартами, "%Валюта%", Объект.ВалютаДокумента);
	Элементы.ОплатаПлатежнымиКартамиИтогСумма.Подсказка = ЗаголовокОплатаПлатежнымиКартами;
	
	ЗаголовокСуммаСдачи = НСтр("ka='ხურდა (%Валюта%)';ru='Сдача (%Валюта%)';en='Letting (% Currency%)'");
	ЗаголовокСуммаСдачи = СтрЗаменить(ЗаголовокСуммаСдачи, "%Валюта%", Объект.ВалютаДокумента);
	Элементы.СуммаСдачи.Подсказка = ЗаголовокСуммаСдачи;

	// Заказы покупателей в Рознице
	ПоложениеРеквизитаНаФормеВШапке = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВШапке");
	РезервироватьЗапасыИИспользоватьЗаказы = (ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") И ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле"));
	Элементы.ЗапасыИзменитьРезерв.Видимость = РезервироватьЗапасыИИспользоватьЗаказы;
	Элементы.ЗапасыРезерв.Видимость = РезервироватьЗапасыИИспользоватьЗаказы;
	
	Если РезервироватьЗапасыИИспользоватьЗаказы Тогда
		Элементы.Зарезервировать.Заголовок = НСтр("ka='გატარება';ru='Провести';en='Conduct'");
		Элементы.СнятьРезервирование.Заголовок = НСтр("ka='გატარების გაუქმება';ru='Отмена проведения';en='cancellation of'");
		Элементы.СнятьРезервирование.ТолькоВоВсехДействиях = Истина;
	Иначе
		Элементы.Зарезервировать.Заголовок = НСтр("ka='დარეზერვება';ru='Зарезервировать';en='Make a reservation'");
		Элементы.СнятьРезервирование.Заголовок = НСтр("ka='რეზერვის მოხსნა';ru='Снять резерв';en='remove the reserve'");
		Элементы.СнятьРезервирование.ТолькоВоВсехДействиях = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьОтправкиЭлектронныхЧеков();
	
	// Установка видимости реквизитов от пользовательских настроек
	УстановитьВидимостьОтПользовательскихНастроек(); 
	// Конец. Заказы покупателей в Рознице
	
	// СтруктурнаяЕдиница - пустой быть не может
	ТипСтруктурнойЕдиницы = Объект.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы;
	
	// ПодборНоменклатурыВДокументах
	ПодборНоменклатурыВДокументах.НазначитьФормуПодбора(ПараметрыОткрытияПодбора, Объект.Ссылка.Метаданные().Имя, "Запасы");
	// Конец ПодборНоменклатурыВДокументах
	
	// АвтоматическиеСкидки.
	АвтоматическиеСкидкиПриСозданииНаСервере();
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсисте.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
		
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ОбновитьЭлектроннаяНакладнаяНадпись();
	ОбновитьСчетФактураОтправленныйНадпись();
	ГруппаКомментарийВыдимость();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Контрагент = AzRyУправлениеНебольшойФирмойСервер.УчетнаяПолитика(ДатаДокумента, Объект.Организация).РозничныйКонтрагент;
	КонецЕсли;
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:

КонецПроцедуры

&НаСервере
&Вместо("ФормаОплатыПриИзмененииНаСервере")
Функция РасшAzRy_ФормаОплатыПриИзмененииНаСервере(ОписаниеОшибки)
	
	Если Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Наличные 
		// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
		Или Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.AzRyРасходнаяНакладнаяНаличные Тогда
		// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
		
		Если Объект.ОплатаПлатежнымиКартами.Количество() > 0 Тогда
			
			Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.ПустаяСсылка();
			
			ОписаниеОшибки = НСтр("ka='ჩატარებულია გადახდა საგადახდო ბარათებით! გადახდის ფორმად ""ნაღდი ფულით"" დაყენება შეუძლებელია';ru='Проведена оплата платежными картами! Установить форму оплаты ""Наличными"" невозможно';en='Held payment payment cards! To establish a form of payment ""Cash"" can not be'");
			Возврат Ложь;
			
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ФормаОплаты) Тогда // Смешанная
		
	Иначе // Платежными картами
		
		Объект.ПолученоНаличными = 0;
		
	КонецЕсли;
	
	УстановитьДоступностьОплаты();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура РасшAzRy_ФормаОплатыПриИзмененииВместо(Элемент)
	
	ОписаниеОшибки = "";
	Если НЕ ФормаОплатыПриИзмененииНаСервере(ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(Неопределено,ОписаниеОшибки);
	КонецЕсли;
	
	// +++ { AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:
	ОбновлениеРеквизитаФормаоплаты();
	// +++ } AzRy - [01.12.2020] - Jira:ERPM-804 - Developer:ადმინი - Comment:

КонецПроцедуры


#Область AzRy

&НаКлиенте
Процедура ЭлектроннаяНакладнаяНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьЭлНакладную(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураОтправленныйНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	Если Не AzRyРаботаСДокументамыКлиентСервер.КонтрагентНалогообложениеНДС(Объект.Контрагент) Тогда
		Предупреждение("კონტრაგენტი არ წარმოადგენს დღგ-ს გადამხდელს. ანგარიშფაქტურა არ შეიქმნება.");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьСчетФактуруГрузия(ЭтотОбъект, Ложь);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьСозданияЭЛНакладной()
	
	Результат = Истина;
	Если Модифицированность Или НЕ ПроверитьЗаполнение() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='დოკუმენტი შეიცვალა. თავდაპირველად, საჭიროა დოკუმენტის ჩაწერა!';ru='Документ был изменен. Сначала следует записать документ!';en='The document has been changed. First, you must write the document!'");	
		Сообщение.Сообщить();
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Если Результат Тогда	
		
		Если Не Объект.Проведен Тогда
			Режим = РежимДиалогаВопрос.ДаНетОтмена;			
			Ответ = Вопрос(НСтр("ka='დოკუმენტი გაუტარებელია. გნებავთ გაგრძელება?';ru='Документ не проведен. хотите продолжить?';en='The document is not posted.Do you whant to continue'"), Режим, 0);						
			Если Ответ <> КодВозвратаДиалога.Да Тогда				
				Результат = Ложь;							
			КонецЕсли; 		
		КонецЕсли;
		
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ГруппаКомментарийВыдимость()

	Элементы.ГруппаКомментарий.Доступность = Объект.AzRyЭлектроннаяНакладная;

КонецФункции

&НаКлиенте
Процедура AzRyЭлектроннаяНакладнаяПриИзменении(Элемент)
	AzRyЭлектроннаяНакладнаяПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура AzRyЭлектроннаяНакладнаяПриИзмененииНаСервере()
	ГруппаКомментарийВыдимость();		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлектроннаяНакладнаяНадпись()

	НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Объект.Ссылка);
	Элементы.ЭлектроннаяНакладнаяНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьЭлНакладная(НайденныйЭлНакладная);	

КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетФактураОтправленныйНадпись()
	
	НайденныйСчетФактура = AzRyУправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйСчетФактура(Объект.Ссылка);
	Элементы.СчетФактураОтправленныйНадпись.Заголовок = AzRyРаботаСДокументамыКлиентСервер.СформироватьНадписьСчетФактураОтправленный(НайденныйСчетФактура, , Объект.Контрагент);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
 	ОбновлениеРеквизитаФормаоплаты();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеРеквизитаФормаоплаты()
	
	Если Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		Объект.Контрагент = AzRyУправлениеНебольшойФирмойСервер.УчетнаяПолитика(ДатаДокумента, Объект.Организация).РозничныйКонтрагент;
		Объект.AzRyЭлектроннаяНакладная = Ложь;
	ИначеЕсли Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.Безналичные Тогда 	
		Объект.Контрагент = AzRyУправлениеНебольшойФирмойСервер.УчетнаяПолитика(ДатаДокумента, Объект.Организация).AzRyРозничныйКонтрагентАналитика;
		Объект.AzRyЭлектроннаяНакладная = Ложь;
	ИначеЕсли (Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.AzRyРасходнаяНакладнаяНаличные Или 
		Объект.ФормаОплаты = Перечисления.ТипыДенежныхСредств.AzRyРасходнаяНакладнаяБезналичные) И ЗначениеЗаполнено(Объект.AzRyАналитикаКонтрагент) Тогда
		Объект.Контрагент = Объект.AzRyАналитикаКонтрагент;
		Объект.AzRyЭлектроннаяНакладная = Истина;
	КонецЕсли; 		
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_AzRyАналитикаКонтрагентПриИзмененииВместо(Элемент)
	ОбновлениеРеквизитаФормаоплаты();
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ПослеЗаписиПосле(ПараметрыЗаписи)
	ГруппаКомментарийВыдимость();	
КонецПроцедуры

//&НаКлиенте
//Процедура РасшAzRy_AzRyАналитикаКонтрагентПриИзмененииПосле(Элемент)
//	
//	ОбновлениеРеквизитаФормаоплаты();
//	
//КонецПроцедуры
 
#КонецОбласти
